online_results/output_length/_260/opt-1.3b/_128__2000/log_15930299.out
WARNING 02-21 19:27:52 _custom_ops.py:19] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Namespace(backend='openai', base_url=None, host='localhost', port=16550, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/dummy_dataset_mean.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/opt/opt-1.3b', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=2000, logprobs=None, request_rate=inf, seed=0, trust_remote_code=False, disable_tqdm=True, profile=False, save_result=True, metadata=None, result_dir='online_results/output_length/_260/opt-1.3b/_128__2000', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', launch_server=True, server_args='--port=16550 --enable-chunked-prefill --disable-log-requests --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/opt/opt-1.3b --max-num-seqs=128', launch_server_with_nsight=False, disable_log_stats=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=260, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Server started
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     2000      
Benchmark duration (s):                  63.71     
Total input tokens:                      484000    
Total generated tokens:                  520000    
Request throughput (req/s):              31.39     
Output token throughput (tok/s):         8161.56   
Total Token throughput (tok/s):          15758.09  
---------------Time to First Token----------------
Mean TTFT (ms):                          30354.67  
Median TTFT (ms):                        29512.42  
P99 TTFT (ms):                           60637.60  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          15.01     
Median TPOT (ms):                        15.31     
P99 TPOT (ms):                           16.16     
---------------Inter-token Latency----------------
Mean ITL (ms):                           15.00     
Median ITL (ms):                         13.73     
P99 ITL (ms):                            24.65     
==================================================
Concurrent checker terminated
Server terminated